hello-yaowq/as-1/com/as.infrastructure/arch/stm32f1/mcal/Can.c
  return rv;
}

void Can_DisableControllerInterrupts( uint8 controller )
{
  imask_t state;
  Can_UnitType *canUnit;
  CAN_HW_t *canHw;

  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x4, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x4, CAN_E_UNINIT );

  Irq_Save(state);
  if(canUnit->lock_cnt > 0 )
  {
    // Interrupts already disabled
    canUnit->lock_cnt++;
    Irq_Restore(state);
    return;
  }
  canUnit->lock_cnt++;
  Irq_Restore(state);

  /* Don't try to be intelligent, turn everything off */
  canHw = GetController(controller);

  /* Turn off the tx interrupt mailboxes */
  CAN_ITConfig(canHw, CAN_IT_TME, DISABLE);

  /* Turn off the bus off/tx warning/rx warning and error and rx  */
  CAN_ITConfig(canHw, CAN_IT_FMP0 | CAN_IT_BOF | CAN_IT_ERR | CAN_IT_WKU, DISABLE);
}

void Can_EnableControllerInterrupts( uint8 controller ) {
  imask_t state;
  Can_UnitType *canUnit;
  CAN_HW_t *canHw;
  const Can_ControllerConfigType *canHwConfig;
  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x5, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x5, CAN_E_UNINIT );

  Irq_Save(state);
  if( canUnit->lock_cnt > 1 )
  {
    // IRQ should still be disabled so just decrement counter
    canUnit->lock_cnt--;
    Irq_Restore(state);
    return;
  } else if (canUnit->lock_cnt == 1)
  {
    canUnit->lock_cnt = 0;
  }
  Irq_Restore(state);

  canHw = GetController(controller);

  canHwConfig = GET_CONTROLLER_CONFIG(Can_Global.channelMap[controller]);

  if( canHwConfig->CanRxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    /* Turn on the rx interrupt */
	CAN_ITConfig(canHw, CAN_IT_FMP0, ENABLE);
  }
  if( canHwConfig->CanTxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
	/* Turn on the tx interrupt mailboxes */
  	CAN_ITConfig(canHw, CAN_IT_TME, ENABLE);
  }

  // BusOff here represents all errors and warnings
  if( canHwConfig->CanBusOffProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
	/* Turn on the bus off/tx warning/rx warning and error and rx  */
	CAN_ITConfig(canHw, CAN_IT_BOF | CAN_IT_ERR | CAN_IT_WKU, ENABLE);
  }

  return;
}

Can_ReturnType Can_Write( Can_Arc_HTHType hth, Can_PduType *pduInfo ) {
  Can_ReturnType rv = CAN_OK;
  CAN_HW_t *canHw;
  const Can_HardwareObjectType *hohObj;
  const Can_ControllerConfigType *canHwConfig;
  uint32 controller;
  imask_t state;

  VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
  VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
  VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
  VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

  hohObj = Can_FindHoh(hth, &controller);
  if (hohObj == NULL)
    return CAN_NOT_OK;

  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);

  canHw = GetController(controller);
  Irq_Save(state);

  CanTxMsg TxMessage;

  TxMessage.RTR=CAN_RTR_DATA;
  TxMessage.DLC=pduInfo->length;

  memcpy(TxMessage.Data, pduInfo->sdu, pduInfo->length);

  if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
	TxMessage.IDE=CAN_ID_EXT;
	TxMessage.ExtId=pduInfo->id;
  } else {
	TxMessage.IDE=CAN_ID_STD;
	TxMessage.StdId=pduInfo->id;
  }

  // check for any free box
  if(CAN_Transmit(canHw,&TxMessage) != CAN_NO_MB) {
    canHwConfig = GET_CONTROLLER_CONFIG(Can_Global.channelMap[controller]);

    if( canHwConfig->CanTxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
  	  /* Turn on the tx interrupt mailboxes */
    	CAN_ITConfig(canHw,CAN_IT_TME, ENABLE);
    }

	// Increment statistics
	canUnit->stats.txSuccessCnt++;

    // Store pdu handle in unit to be used by TxConfirmation
    canUnit->swPduHandle = pduInfo->swPduHandle;
  } else {
    rv = CAN_BUSY;
  }
  Irq_Restore(state);

  return rv;
}
void Can_MainFunction_Write ( void )
{

}
void Can_MainFunction_Error ( void )
{

}
void Can_MainFunction_Read( void ) {

	/* NOT SUPPORTED */
}

void Can_MainFunction_BusOff( void ) {
  /* Bus-off polling events */

	/* NOT SUPPORTED */
}

void Can_MainFunction_Wakeup( void ) {
  /* Wakeup polling events */

	/* NOT SUPPORTED */
}


/**
 * Get send/receive/error statistics for a controller
 *
 * @param controller The controller
 * @param stats Pointer to data to copy statistics to
 */

void Can_Arc_GetStatistics( uint8 controller, Can_Arc_StatisticsType *stats)
{
  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);
  *stats = canUnit->stats;
}

#else /* USE_SIMUL_CAN */
#include "stm32f10x.h"
#include "stm32f10x_usart.h"

static char r_cache[32];
static uint32_t  r_size;
static uint32_t IntH(char chr)
{
	uint32_t v;
	if( (chr>='0') && (chr<='9'))
	{
		v= chr - '0';
	}
	else if( (chr>='A') && (chr<='F'))
	{
		v= chr - 'A';
	}
	else if( (chr>='a') && (chr<='f'))
	{
		v= chr - 'a';
	}
	else
	{
		ASWARNING("CAN serial receiving invalid data '0x%02X', cast to 0\n",chr);
		v = 0;
	}

	return v;
}
static void rx_notifiy( void )
{
	uint8_t busid;
	uint32_t canid;
	uint32_t dlc;
	uint8_t  data[8];
	uint32_t i;
	if( (r_size >= 12) &&
		(r_cache[0]='S') &&
		(r_cache[1]='C') &&
		(r_cache[2]='A') &&
		(r_cache[3]='N') )
	{
		busid = IntH(r_cache[4])*16 + IntH(r_cache[5]);
		canid = IntH(r_cache[6])*16*16*16 + IntH(r_cache[7])*16*16 + IntH(r_cache[8])*16 + IntH(r_cache[9]);
		dlc   = IntH(r_cache[10])*16 + IntH(r_cache[11]);
		if((dlc>0) &&(dlc<=8))
		{
			for(i=0;i<dlc;i++)
			{
				data[i] = IntH(r_cache[12+2*i])*16 + IntH(r_cache[13+2*i]);
			}

			CanIf_RxIndication(busid, canid, dlc, data);
		}
		else
		{
			ASWARNING("CAN serial receiving data with invalid dlc = %d\n",(int)dlc);
		}
	}
	else
	{
		ASWARNING("CAN serial receiving invalid data\n");
	}

	r_size = 0;
}

void Can_Init( const Can_ConfigType *Config )
{
  // Do initial configuration of layer here
	(void)Config;
	r_size = 0;
}

void Can_InitController( uint8 controller, const Can_ControllerConfigType *config)
{
	(void)controller;
	(void)config;
}

Can_ReturnType Can_SetControllerMode( uint8 Controller, Can_StateTransitionType transition )
{
	(void)Controller;
	switch(transition )
	{
		case CAN_T_START:	/* no break here */
		case CAN_T_WAKEUP:
			USART_ITConfig(USART2,USART_IT_RXNE,ENABLE);
			NVIC_EnableIRQ(USART2_IRQn);
		break;
		case CAN_T_SLEEP:
		case CAN_T_STOP:
		default:
			USART_ITConfig(USART2,USART_IT_RXNE,DISABLE);
			NVIC_DisableIRQ(USART2_IRQn);
		break;
	}
	return E_OK;
}

Can_ReturnType Can_Write( Can_Arc_HTHType hth, Can_PduType *pduInfo )
{
	// Write to mailbox on controller here.
	char string[32];
	uint32_t i;
	int size = snprintf(string,sizeof(string),"SCAN%02X%04X%02X",hth,(unsigned int)pduInfo->id,pduInfo->length);
	asAssert(pduInfo->length <= 8);
	for(i=0;i<pduInfo->length;i++)	/* maximum 16 */
	{
		size += snprintf(&string[size],sizeof(string)-size,"%02X",pduInfo->sdu[i]);
	}
	string[size++] = '\n';
	string[size++] = '\0';
	asAssert(size <= 32);
	puts(string);
	return E_OK;
}
void knl_isr_usart2_process(void)	/* USART2_IRQn = 38 + 15 = 53 */
{

	if(USART_GetITStatus(USART2,USART_IT_RXNE))
	{

		char chr = (char)(USART_ReceiveData(USART2)&0xFF);

		r_cache[r_size++] = chr;

		if(chr == '\n')
		{
			rx_notifiy();
		}

		if(r_size >= sizeof(r_cache))
		{
			r_size = 0;
		}
		USART_ClearITPendingBit(USART2,USART_IT_RXNE);
	}

	NVIC_ClearPendingIRQ(USART2_IRQn);
}

void Can_DisableControllerInterrupts( uint8 controller )
{
	(void)controller;
	NVIC_DisableIRQ(USART2_IRQn);
}

void Can_EnableControllerInterrupts( uint8 controller )
{
	(void)controller;
	NVIC_EnableIRQ(USART2_IRQn);
}


// Hth - for Flexcan, the hardware message box number... .We don't care
void Can_Cbk_CheckWakeup( uint8 controller ){(void)controller;}

void Can_MainFunction_Write( void ){}
void Can_MainFunction_Read( void ){}
void Can_MainFunction_BusOff( void ){}
void Can_MainFunction_Wakeup( void ){}
void Can_MainFunction_Error ( void ){}

void Can_Arc_GetStatistics( uint8 controller, Can_Arc_StatisticsType * stat){(void)controller;(void)stat;}

#endif


